app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY title ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG', 'PG-13') ORDER BY title ASC
SELECT "movies".* FROM "movies" ORDER BY release_date ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG', 'PG-13') ORDER BY release_date ASC
SELECT "movies".* FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG', 'PG-13')
---
    when "title" then

      if @selected.empty? then
        Movie.order("title ASC")
      else
        Movie.where(:rating => @selected).order("title ASC")
      end
    when "release_date" then
      if @selected.empty? then
        Movie.order("release_date ASC")
      else
        Movie.where(:rating => @selected).order("release_date ASC")
      end
    else
      if @selected.empty? then
        Movie.all
      else
        Movie.where(:rating => @selected)